# Practice with Pandas

In [2]:
import pandas as pd

In [3]:
# Make a data frame D with two columns "name" (String) and "Vaccined" (boolean) each with 5 entries

D = pd.DataFrame({'Name': ['Paulo', 'Roberta', 'João', 'James', 'Mohammed'], 'Vaccined': [True, False, True, False, True]})

print(D)

# OR

names = {
    '0': 'Paulo',
    '1': 'Roberta',
    '2': 'João',
    '3': 'James',
    '4': 'Mohammed'
}

vaccined = {
    '0': True,
    '1': False,
    '2': True,
    '3': False,
    '4': True
}

D = pd.DataFrame({'Name': names, 'Vaccined': vaccined})

print(f'\nAnother way to create a dataframe:\n\n{D}')

       Name  Vaccined
0     Paulo      True
1   Roberta     False
2      João      True
3     James     False
4  Mohammed      True

Another way to create a dataframe:

       Name  Vaccined
0     Paulo      True
1   Roberta     False
2      João      True
3     James     False
4  Mohammed      True

In [4]:
# Store the names with true vaccined records in another dataframe M

M = D[D['Vaccined'] == True]

print(M)

       Name  Vaccined
0     Paulo      True
2      João      True
4  Mohammed      True

In [6]:
# Extend it by adding another column of "Country" in with two only categories "Pakistan" and "China"
D['Country'] = ['Pakistan', 'China', 'Pakistan', 'China', 'Pakistan']

D

       Name  Vaccined   Country
0     Paulo      True  Pakistan
1   Roberta     False     China
2      João      True  Pakistan
3     James     False     China
4  Mohammed      True  Pakistan

In [15]:
# Now groupy the data by Country and take the sum

D.groupby(['Country']).sum()

                       Name  Vaccined
Country
China          RobertaJames         0
Pakistan  PauloJoãoMohammed         3

Make a data frame with the values:

| | A | B | C |
| --- | --- | --- | --- |
0 | 12 | 1 | 11 |
1 | 4 | 42 | 5 |
2 | 19 | 55 | 13|
3 | 20 | 61 | 66 |
4 | 35 | 32 | 31 |

In [19]:
import numpy as np
df = pd.DataFrame(np.array([[12, 1, 11], [4, 42, 5], [19, 55, 13], [20, 61, 66], [35, 32, 31]]),
                   columns=['A', 'B', 'C'])

# OR 

df = pd.DataFrame({'A': [12, 4, 19, 20, 35], 'B': [1, 42, 55, 61, 32], 'C': [11, 5, 13, 66, 31]})

In [21]:
# Now use the rolling and sum up every 3 values in the table i.e take a step of 3 and do Not include any NaN values
df.rolling(3, min_periods=1).sum()

      A      B      C
0  12.0    1.0   11.0
1  16.0   43.0   16.0
2  35.0   98.0   29.0
3  43.0  158.0   84.0
4  74.0  148.0  110.0

In [26]:
# Create a data frame and change the values that are less than 10 to 10 and greater than 30 to 30 using WHERE 

df = pd.DataFrame(np.random.randint(0,50,(5,10)), columns=list("ABCDEGHIJK"))
df

    A   B   C   D   E   G   H   I   J   K
0  10   2   9  23  19  34   7  31  40   5
1  14  21  12  24  11  13   0  28  14   7
2  10  19  18  27   6  10   9  24  38  20
3  47  34  48   7  47  24   2  32  27  26
4  21  23  29  21  47  30  10  37   3  47

In [29]:
df = df.where((df > 10) | (df < 30), 10).where(df < 30, 30)
df.clip(10,30)

    A   B   C   D   E   G   H   I   J   K
0  10  10  10  23  19  30  10  30  30  10
1  14  21  12  24  11  13  10  28  14  10
2  10  19  18  27  10  10  10  24  30  20
3  30  30  30  10  30  24  10  30  27  26
4  21  23  29  21  30  30  10  30  10  30

Make two data frame:

| | Name | Subject1 |
| --- | --- | --- |
| 0 | Anna | English | 
| 1 | Stuart | Maths |
| 2 | Alex | Geography |
| 3 | Nancy | English |
| 4 | Robert | Maths|

And 

| | Name | Subject2 |
| --- | --- | --- |
| 0 | Alex | Eletronics |
| 1 | Robert | Maths |
| 2 | Anna | Geography |
| 3 | Stuart | English |
| 4 | Nancy | Computer |

In [31]:
df = pd.DataFrame({'Name': ['Anna', 'Stuart', 'Alex', 'Nancy', 'Robert'],
                   'Subject1': ['English', 'Maths', 'Geography', 'English', 'Maths']})

df1 = pd.DataFrame({'Name': ['Alex', 'Robert', 'Anna', 'Stuart', 'Nancy'],
                    'Subject2': ['Eletronics', 'Maths', 'Geography', 'English' , 'Computer']})

In [35]:
# Now make a new data frame by merging these two data frames

df2 = pd.merge(df, df1, on='Name')
df2

     Name   Subject1    Subject2
0    Anna    English   Geography
1  Stuart      Maths     English
2    Alex  Geography  Eletronics
3   Nancy    English    Computer
4  Robert      Maths       Maths